<a href="https://colab.research.google.com/github/yopinator/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Joseph_Kupec_LSDS113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [83]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-11-08 01:14:14--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.106.37
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.106.37|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  68.1MB/s    in 2.9s

2019-11-08 01:14:17 (68.1 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [84]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [85]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01/instacart_2017_05_01/instacart_2017_05_01

In [86]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####
#typical pandas project imports
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

Find columns and dataframes containing the most frequently ordered products

In [88]:
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__prior.sample(10)

          order_id  product_id  add_to_cart_order  reordered
30027267   3167264       28999                 11          1
25256559   2663755       47144                 37          1
11101197   1171907       31372                  3          1
840248       88982       13733                  7          0
30768302   3245522       34243                 28          1
3948126     416594       34570                 14          0
4012027     423333       26283                  2          0
10636504   1122871       11345                  1          1
17441445   1839722       19767                  5          0
28433680   2998651       33000                 37          0

In [0]:
#we only need a few columns
cols=['product_id', 'order_id', 'add_to_cart_order']
order_products__prior=order_products__prior[cols]

In [90]:
#do the same with the order_products_train df to concat
order_products__train = pd.read_csv('order_products__train.csv')
order_products__train.sample(10)

         order_id  product_id  add_to_cart_order  reordered
889853    2195625       20574                  4          1
818200    2018339        8506                  9          0
881922    2175193       27966                  1          1
535562    1315714        8153                  1          1
1275802   3151939        4066                 33          1
1320074   3261335       33787                  9          1
484987    1189459       49683                 21          0
197135     483079       32700                 18          0
475391    1164833       14197                  3          1
745492    1833705       47626                 10          0

In [0]:
#we only need a few columns
cols=['product_id', 'order_id', 'add_to_cart_order']
order_products__train=order_products__train[cols]

In [92]:
#concatenate

order_products = pd.concat([order_products__prior, order_products__train])
order_products.shape
order_products

         product_id  order_id  add_to_cart_order
0             33120         2                  1
1             28985         2                  2
2              9327         2                  3
3             45918         2                  4
4             30035         2                  5
...             ...       ...                ...
1384612       14233   3421063                  3
1384613       35548   3421063                  4
1384614       35951   3421070                  1
1384615       16953   3421070                  2
1384616        4724   3421070                  3

[33819106 rows x 3 columns]

In [93]:
products = pd.read_csv('products.csv')
products.sample(10)

       product_id  ... department_id
28751       28752  ...            19
3836         3837  ...            19
5021         5022  ...             4
4462         4463  ...            16
561           562  ...            21
2583         2584  ...             3
33498       33499  ...            19
614           615  ...            19
44365       44366  ...             1
7491         7492  ...            16

[10 rows x 4 columns]

In [0]:
#filter to just the columns we need
cols=['product_id', 'product_name']
products=products[cols]

Merge the DataFrames

In [95]:
#what is the common key
print(order_products.columns)
print(products.columns)

Index(['product_id', 'order_id', 'add_to_cart_order'], dtype='object')
Index(['product_id', 'product_name'], dtype='object')

In [0]:
# merge the two df's on the common key.
# we use the 'on' parameter to look up and copy information from the two df's into a combined df.
merged = pd.merge(order_products, products, on='product_id', how='left')
add2order = merged.sort_values(by='add_to_cart_order', ascending=False)

In [97]:
add2order.head(10)

#if add_to_cart_order displays how many times a product has been ordered, these are the most popular items. these do not match up with the items listed at the top of the page

          product_id  ...                         product_name
14825330       23737  ...       Organic 100% Grapefruit  Juice
14825329       43182  ...                        Almond Butter
14825328       21230  ...       Organic Himalayan Pink Popcorn
14825327       22594  ...  Quattro Formaggi Four Cheeses Pizza
14825326       46346  ...     Sweet Potato Fries with Sea Salt
14825325       19019  ...              Uncured Slow Cooked Ham
14825324       21616  ...                 Organic Baby Arugula
14825323       26940  ...        Organic Large Green Asparagus
14825322       18090  ...      Organic Large White Flesh Peach
7492555        33572  ...     Lactose Free 2% Reduced Fat Milk

[10 rows x 4 columns]

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
#create a simple table
myindex=['John Smith', 'Jane Doe', 'Mary Johnson']
mycolumns=['treatmenta', 'treatmentb']

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16, 11],
     [3, 1]],
     columns=mycolumns,
     index=myindex
)

In [99]:
#example of wide format
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [100]:
#exactly the same info can be displayed by transposing the table (also wide format)

table2 = table1.T
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

TABLE 1 --> TIDY

In [101]:
#First get the column names as a list
list(table1.columns)
table1.columns.tolist()

['treatmenta', 'treatmentb']

In [102]:
#Now get the index values as another list
table1.index.tolist()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [103]:
#For table 1, convert the index into a column using the 'reset_index' method
table1 = table1.reset_index()
table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [104]:
#convert table from 'wide' to 'tidy' format using the melt method
tidy = table1.melt(id_vars='index'   , value_vars =['treatmenta', 'treatmentb'])
tidy

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [105]:
#rename the columns
tidy= tidy.rename(columns={ 'index':'name', 'variable':'trt', 'value':'result'})
tidy

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [106]:
#shorten 'trt' values
tidy['trt'] = tidy['trt'].str.replace('treatment', '')
tidy

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

TABLE2-->TIDY

In [107]:
#get columns as a list
list(table2.columns)

['John Smith', 'Jane Doe', 'Mary Johnson']

In [108]:
#get index values as a list
table2.index.tolist()

['treatmenta', 'treatmentb']

In [109]:
#convert the index into a column using 'reset_index' method
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [110]:
# Convert the table from 'wide' to 'tidy' format using the `melt` method.
tidy2 = table2.melt(id_vars='index'    , value_vars =['John Smith', 'Jane Doe', 'Mary Johnson'] )
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [111]:
#rename columns
tidy2 = tidy.rename(columns={ 'index':'trt', 'variable':'name', 'value':'result'})
tidy2

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [112]:
#shorten the 'trt' values
tidy2['trt'] = tidy2['trt'].str.replace('treatment', '')
tidy2

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

TIDY --> TABLE 1

In [113]:
#pivot_tale function is the inverse of melt
wide = tidy.pivot_table(index='name' , columns= 'trt', values='result')
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

TIDY --> TABLE 2

In [118]:
wide2 = tidy2.pivot_table(index='name' , columns= 'trt', values='result')
wide2

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

Load seaborn's flights dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [120]:
flights = sns.load_dataset('flights')
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [0]:
pflights = flights.pivot_table(index='year', columns= 'month', values='passengers')

In [122]:
pflights

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####